; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v1 ?v2)
             (pred_12 ?v6 ?v10)
             (pred_8 ?v1 ?v10)
             (pred_6 ?v3 ?v1 )
	     (pred_10 ?v1)
             (pred_3 ?v7)
             (pred_4 ?v6)
             (pred_11 ?v10)
             (pred_1 ?v1)
             (pred_9 ?v6)
             (pred_5 ?v1)
             (pred_2 ))



(:action op_2
:parameters (?v8 ?v13 ?v12 ?v5)
:precondition (and (pred_3 ?v8) (pred_3 ?v13) (pred_4 ?v12) (pred_11 ?v5)
          (pred_7 ?v8 ?v13) (pred_12 ?v12 ?v5)
                   (pred_8 ?v13 ?v5) (pred_10 ?v8) 
                   (pred_1 ?v13) (pred_9 ?v12))
:effect (and  (pred_5 ?v13) (not (pred_1 ?v13))))


(:action op_4
:parameters (?v8 ?v4)
:precondition (and (pred_3 ?v8) (pred_3 ?v4)
               (pred_10 ?v8) (pred_7 ?v8 ?v4) (pred_5 ?v4))
:effect (and (pred_10 ?v4) (not (pred_10 ?v8))))

(:action op_3
:parameters (?v8 ?v12)
:precondition (and (pred_3 ?v8) (pred_4 ?v12) 
                  (pred_10 ?v8) (pred_6 ?v12 ?v8) (pred_2 ))
:effect (and (pred_9 ?v12)
   (not (pred_6 ?v12 ?v8)) (not (pred_2 ))))


(:action op_5
:parameters (?v8 ?v9 ?v11)
:precondition (and (pred_3 ?v8) (pred_4 ?v9) (pred_4 ?v11)
                  (pred_10 ?v8) (pred_9 ?v11) (pred_6 ?v9 ?v8))
:effect (and (pred_9 ?v9) (pred_6 ?v11 ?v8)
        (not (pred_9 ?v11)) (not (pred_6 ?v9 ?v8))))

(:action op_1
:parameters (?v8 ?v12)
:precondition (and (pred_3 ?v8) (pred_4 ?v12) 
                  (pred_10 ?v8) (pred_9 ?v12))
:effect (and (pred_2 ) (pred_6 ?v12 ?v8) (not (pred_9 ?v12)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_18 obj_06 obj_05 obj_16 obj_09 obj_24 obj_15 obj_14 obj_10 obj_04 obj_20 obj_29 obj_22 obj_25 obj_21 obj_13 obj_01 obj_08 obj_07 obj_17 obj_28 obj_03 obj_23 obj_27 obj_30
    obj_26 obj_11
    obj_02 obj_19 obj_12
    )

    (:init
       (pred_2)

       (pred_3 obj_18)
       (pred_3 obj_06)
       (pred_3 obj_05)
       (pred_3 obj_16)
       (pred_3 obj_09)
       (pred_3 obj_24)
       (pred_3 obj_15)
       (pred_3 obj_14)
       (pred_3 obj_10)
       (pred_3 obj_04)
       (pred_3 obj_20)
       (pred_3 obj_29)
       (pred_3 obj_22)
       (pred_3 obj_25)
       (pred_3 obj_21)
       (pred_3 obj_13)
       (pred_3 obj_01)
       (pred_3 obj_08)
       (pred_3 obj_07)
       (pred_3 obj_17)
       (pred_3 obj_28)
       (pred_3 obj_03)
       (pred_3 obj_23)
       (pred_3 obj_27)
       (pred_3 obj_30)
       (pred_11 obj_26)
       (pred_11 obj_11)
       (pred_4 obj_02)
       (pred_4 obj_19)
       (pred_4 obj_12)

       (pred_7 obj_18 obj_24)
       (pred_7 obj_18 obj_06)
       (pred_7 obj_06 obj_15)
       (pred_7 obj_06 obj_05)
       (pred_7 obj_06 obj_18)
       (pred_7 obj_05 obj_14)
       (pred_7 obj_05 obj_16)
       (pred_7 obj_05 obj_06)
       (pred_7 obj_16 obj_10)
       (pred_7 obj_16 obj_09)
       (pred_7 obj_16 obj_05)
       (pred_7 obj_09 obj_04)
       (pred_7 obj_09 obj_16)
       (pred_7 obj_24 obj_20)
       (pred_7 obj_24 obj_15)
       (pred_7 obj_24 obj_18)
       (pred_7 obj_15 obj_29)
       (pred_7 obj_15 obj_14)
       (pred_7 obj_15 obj_06)
       (pred_7 obj_15 obj_24)
       (pred_7 obj_14 obj_22)
       (pred_7 obj_14 obj_10)
       (pred_7 obj_14 obj_05)
       (pred_7 obj_14 obj_15)
       (pred_7 obj_10 obj_25)
       (pred_7 obj_10 obj_04)
       (pred_7 obj_10 obj_16)
       (pred_7 obj_10 obj_14)
       (pred_7 obj_04 obj_21)
       (pred_7 obj_04 obj_09)
       (pred_7 obj_04 obj_10)
       (pred_7 obj_20 obj_13)
       (pred_7 obj_20 obj_29)
       (pred_7 obj_20 obj_24)
       (pred_7 obj_29 obj_01)
       (pred_7 obj_29 obj_22)
       (pred_7 obj_29 obj_15)
       (pred_7 obj_29 obj_20)
       (pred_7 obj_22 obj_08)
       (pred_7 obj_22 obj_25)
       (pred_7 obj_22 obj_14)
       (pred_7 obj_22 obj_29)
       (pred_7 obj_25 obj_07)
       (pred_7 obj_25 obj_21)
       (pred_7 obj_25 obj_10)
       (pred_7 obj_25 obj_22)
       (pred_7 obj_21 obj_17)
       (pred_7 obj_21 obj_04)
       (pred_7 obj_21 obj_25)
       (pred_7 obj_13 obj_28)
       (pred_7 obj_13 obj_01)
       (pred_7 obj_13 obj_20)
       (pred_7 obj_01 obj_03)
       (pred_7 obj_01 obj_08)
       (pred_7 obj_01 obj_29)
       (pred_7 obj_01 obj_13)
       (pred_7 obj_08 obj_23)
       (pred_7 obj_08 obj_07)
       (pred_7 obj_08 obj_22)
       (pred_7 obj_08 obj_01)
       (pred_7 obj_07 obj_27)
       (pred_7 obj_07 obj_17)
       (pred_7 obj_07 obj_25)
       (pred_7 obj_07 obj_08)
       (pred_7 obj_17 obj_30)
       (pred_7 obj_17 obj_21)
       (pred_7 obj_17 obj_07)
       (pred_7 obj_28 obj_03)
       (pred_7 obj_28 obj_13)
       (pred_7 obj_03 obj_23)
       (pred_7 obj_03 obj_01)
       (pred_7 obj_03 obj_28)
       (pred_7 obj_23 obj_27)
       (pred_7 obj_23 obj_08)
       (pred_7 obj_23 obj_03)
       (pred_7 obj_27 obj_30)
       (pred_7 obj_27 obj_07)
       (pred_7 obj_27 obj_23)
       (pred_7 obj_30 obj_17)
       (pred_7 obj_30 obj_27)
       (pred_1 obj_23)
       (pred_1 obj_21)
       (pred_1 obj_01)
       (pred_8  obj_23 obj_26)
       (pred_8  obj_21 obj_11)
       (pred_8  obj_01 obj_26)
       (pred_5 obj_18)
       (pred_5 obj_06)
       (pred_5 obj_05)
       (pred_5 obj_16)
       (pred_5 obj_09)
       (pred_5 obj_24)
       (pred_5 obj_15)
       (pred_5 obj_14)
       (pred_5 obj_10)
       (pred_5 obj_04)
       (pred_5 obj_20)
       (pred_5 obj_29)
       (pred_5 obj_22)
       (pred_5 obj_25)
       (pred_5 obj_13)
       (pred_5 obj_08)
       (pred_5 obj_07)
       (pred_5 obj_17)
       (pred_5 obj_28)
       (pred_5 obj_03)
       (pred_5 obj_27)
       (pred_5 obj_30)

       (pred_12  obj_02 obj_26)
       (pred_12  obj_19 obj_11)
       (pred_12  obj_12 obj_26)
       (pred_6 obj_02 obj_10)
       (pred_6 obj_19 obj_22)
       (pred_6 obj_12 obj_03)
       (pred_10 obj_06)
    )

    (:goal (and
       (pred_6 obj_02 obj_17)
       (pred_6 obj_12 obj_05)
    ))
(:constraints
  (always (not (pred_10 obj_25)))
)
)

; plan
1. (op_4 obj_06 obj_05)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_05)
   goals met: 0 of 2
2. (op_4 obj_05 obj_14)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_14)
   goals met: 0 of 2
3. (op_4 obj_14 obj_10)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_10)
   goals met: 0 of 2
4. (op_3 obj_10 obj_02)
   deleted: (pred_6 obj_02 obj_10) (pred_2)
   added: (pred_9 obj_02)
   goals met: 0 of 2
5. (op_4 obj_10 obj_14)
   deleted: (pred_10 obj_10)
   added: (pred_10 obj_14)
   goals met: 0 of 2
6. (op_4 obj_14 obj_22)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_22)
   goals met: 0 of 2
7. (op_4 obj_22 obj_08)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_08)
   goals met: 0 of 2
8. (op_2 obj_08 obj_23 obj_02 obj_26)
   deleted: (pred_1 obj_23)
   added: (pred_5 obj_23)
   goals met: 0 of 2
9. (op_4 obj_08 obj_23)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_23)
   goals met: 0 of 2
10. (op_1 obj_23 obj_02)
   deleted: (pred_9 obj_02)
   added: (pred_2) (pred_6 obj_02 obj_23)
   goals met: 0 of 2
11. (op_4 obj_23 obj_03)
   deleted: (pred_10 obj_23)
   added: (pred_10 obj_03)
   goals met: 0 of 2
12. (op_3 obj_03 obj_12)
   deleted: (pred_6 obj_12 obj_03) (pred_2)
   added: (pred_9 obj_12)
   goals met: 0 of 2
13. (op_4 obj_03 obj_23)
   deleted: (pred_10 obj_03)
   added: (pred_10 obj_23)
   goals met: 0 of 2
14. (op_4 obj_23 obj_08)
   deleted: (pred_10 obj_23)
   added: (pred_10 obj_08)
   goals met: 0 of 2
15. (op_1 obj_08 obj_12)
   deleted: (pred_9 obj_12)
   added: (pred_2) (pred_6 obj_12 obj_08)
   goals met: 0 of 2
16. (op_4 obj_08 obj_23)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_23)
   goals met: 0 of 2
17. (op_3 obj_23 obj_02)
   deleted: (pred_6 obj_02 obj_23) (pred_2)
   added: (pred_9 obj_02)
   goals met: 0 of 2
18. (op_4 obj_23 obj_08)
   deleted: (pred_10 obj_23)
   added: (pred_10 obj_08)
   goals met: 0 of 2
19. (op_4 obj_08 obj_07)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_07)
   goals met: 0 of 2
20. (op_4 obj_07 obj_17)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_17)
   goals met: 0 of 2
21. (op_1 obj_17 obj_02)
   deleted: (pred_9 obj_02)
   added: (pred_2) (pred_6 obj_02 obj_17)
   goals met: 1 of 2
22. (op_4 obj_17 obj_07)
   deleted: (pred_10 obj_17)
   added: (pred_10 obj_07)
   goals met: 1 of 2
23. (op_4 obj_07 obj_08)
   deleted: (pred_10 obj_07)
   added: (pred_10 obj_08)
   goals met: 1 of 2
24. (op_3 obj_08 obj_12)
   deleted: (pred_6 obj_12 obj_08) (pred_2)
   added: (pred_9 obj_12)
   goals met: 1 of 2
25. (op_4 obj_08 obj_22)
   deleted: (pred_10 obj_08)
   added: (pred_10 obj_22)
   goals met: 1 of 2
26. (op_4 obj_22 obj_14)
   deleted: (pred_10 obj_22)
   added: (pred_10 obj_14)
   goals met: 1 of 2
27. (op_4 obj_14 obj_05)
   deleted: (pred_10 obj_14)
   added: (pred_10 obj_05)
   goals met: 1 of 2
28. (op_1 obj_05 obj_12)
   deleted: (pred_9 obj_12)
   added: (pred_2) (pred_6 obj_12 obj_05)
   goals met: 2 of 2
